slides/2013-02-08-Lab.org
* Lab: Data Stats :slide:
  + Obtain California (CA) [[http://www.fec.gov/disclosurep/PDownload.do][campaign finance data]]
  + Decompress
  + Manually check
  + Run =code/stats.py=
  + Edit =code/stats.py= to add functionality
  + Pull Request submission

* Data :slide:
  + [[http://www.fec.gov/disclosurep/PDownload.do][campaign finance data]]
  + We'll just be using CA data
  + Decompress and investigate using the tools we discussed

* Code :slide:
#+begin_src bash
$ git checkout master
$ git pull jblomo master
$ git checkout -b hw-stats
#+end_src
  + Run and edit =code/stats.py=

* Stats :slide:
  + Minimum
  + Maximum
  + Mean
  + Median
  + Standard Deviation
  + Candidates
  + Normalized sample contributions

* Extra Credit :slide:
  + Extra credit is used to get you *up to 100%*
  + On the *current assignment*
  + Also helpful for learning topics more in depth
  + You may do partial extra credit
** Overall Extra Credit :notes:
   + EC that applies to overall grade will not be assigned

* Extra Credit :slide:
  + Stats per candidate
  + z-score

* Git usage :slide:
  + All edits, commits, pushes should happen on a =hw-= or =project= branch
  + =git status=
  + All pulls (typically from =jblomo=) should happen on =master= branch
   + If you use an editor connected to ischool server, make sure you are
     *either* editing *or* using git
** Exceptions :notes:
   + There are exceptions but know what you're trying to do
   + External editors can write back files *after* you've changed git branches

* Submission :slide:
  + GitHub pull request
  + If something is going wrong, submit by email: jblomo@ischool,
    shreyas@ischool
  + We'll help you submit the pull request, but HW will be full credit
** Submission :notes:
   + The pull request is a way for Shreyas and I to easily see changes, grade
   + It'll give you good experience, but it is not a fundamental skill of the
     class, so I'm not too worried about it

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
