slides/2013-02-08-Lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2013-02-08-Lab</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2013-02-08-Lab"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-08 13:51:10 PST"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2013-02-08-Lab</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Lab: Data Stats</a></li>
<li><a href="#sec-2">2 Data</a></li>
<li><a href="#sec-3">3 Code</a></li>
<li><a href="#sec-4">4 Stats</a></li>
<li><a href="#sec-5">5 Extra Credit</a>
<ul>
<li><a href="#sec-5-1">5.1 Overall Extra Credit</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Extra Credit</a></li>
<li><a href="#sec-7">7 Git usage</a>
<ul>
<li><a href="#sec-7-1">7.1 Exceptions</a></li>
</ul>
</li>
<li><a href="#sec-8">8 Submission</a>
<ul>
<li><a href="#sec-8-1">8.1 Submission</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lab: Data Stats &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Obtain California (CA) <a href="http://www.fec.gov/disclosurep/PDownload.do">campaign finance data</a>
</li>
<li>Decompress
</li>
<li>Manually check
</li>
<li>Run <code>code/stats.py</code>
</li>
<li>Edit <code>code/stats.py</code> to add functionality
</li>
<li>Pull Request submission
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><a href="http://www.fec.gov/disclosurep/PDownload.do">campaign finance data</a>
</li>
<li>We'll just be using CA data
</li>
<li>Decompress and investigate using the tools we discussed
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Code &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-bash">$ git checkout master
$ git pull jblomo master
$ git checkout -b hw-stats
</pre>

<ul>
<li>Run and edit <code>code/stats.py</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Stats &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Minimum
</li>
<li>Maxiumum
</li>
<li>Mean
</li>
<li>Median
</li>
<li>Standard Deviation
</li>
<li>Candidates
</li>
<li>Normalized sample contributions
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Extra Credit &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>Extra credit is used to get you <b>up to 100%</b>
</li>
<li>On the <b>current assignment</b>
</li>
<li>Also helpful for learning topics more in depth
</li>
<li>You may do partial extra credit
</li>
</ul>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Overall Extra Credit &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>EC that applies to overall grade will not be assigned
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Extra Credit &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Stats per candidate
</li>
<li>z-score
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Git usage &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>All edits, commits, pushes should happen on a <code>hw-</code> or <code>project</code> branch
</li>
<li><code>git status</code>
</li>
<li>All pulls (typically from <code>jblomo</code>) should happen on <code>master</code> branch
<ul>
<li>If you use an editor connected to ischool server, make sure you are
     <b>either</b> editing <b>or</b> using git
</li>
</ul>

</li>
</ul>


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Exceptions &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>There are exceptions but know what you're trying to do
</li>
<li>External editors can write back files <b>after</b> you've changed git branches
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Submission &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>GitHub pull request
</li>
<li>If something is going wrong, submit by email: jblomo@ischool,
    shreyas@ischool
</li>
<li>We'll help you submit the pull request, but HW will be full credit
</li>
</ul>


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Submission &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>The pull request is a way for Shreyas and I to easily see changes, grade
</li>
<li>It'll give you good experience, but it is not a fundemental skill of the
     class, so I'm not too worried about it
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-08 13:51:10 PST</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
